# Pacman package list for Arch-based distributions
# Format: one package name per line
# Lines starting with # are comments and will be ignored

# Terminal utilities
zsh
fzf
tmux
lsd
fastfetch
ripgrep
fd
bat
lolcat
lnav

# Development tools
git
neovim
helix
python
gcc
make

# Networking tools
curl
wget
nmap
networkmanager
modemmanager
usb_modeswitch
mobile-broadband-provider-info
tailscale

# GUI tools
pamac-aur
wl-clipboard
sunshine

# Fingerprint reader support
fprintd
libfprint
